Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg54/svd/ATSAMG54J19.svd
            <register>
               <name>SCHMITT</name>
               <description>Schmitt Trigger Register</description>
               <addressOffset>0x0100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SCHMITT0</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT1</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT2</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT3</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT4</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT5</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT6</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT7</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT8</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT9</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT10</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT11</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT12</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT13</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT14</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT15</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT16</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT17</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT18</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT19</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT20</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT21</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT22</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT23</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT24</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT25</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT26</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT27</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT28</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT29</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT30</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT31</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
